# 开场白/过渡语/结束语，录制成单独的音频文件，方便重复使用

subtitles = {
    0: [
        '我们在创作短视频的过程中经常需要用Pr对原始视频素材进行剪辑',
        '然后将剪辑片段单独导出来，导入Ae进行二次创作',
        '但是Pr不能把所有剪辑好的片段一次性导出来，需要用户一个个手动导出，非常浪费时间'
        '所以我希望写一个Pr插件，可以选择需要导出的序列，一键自动导出所有剪辑片段',
        '减少重复性工作，节省时间，提升创作效率'
    ],
    # 每一步的操作步骤捡重要的演示一遍，代码重新敲一遍，录制屏幕，鼠标尺寸选2，点击时加图形动画comp特效
    # 使用方框，下划线，箭头等图形元素强调重点，文字注释帮助理解
    1: [
        '第一步：查阅Adobe-CEP文档，学习怎么为Pr编写插件'
    ],
    2: [
        '第二步：根据Getting-Started-guides，一步步实现可以运行的插件'
    ],
    3: [
        '第三步：优化插件的UI界面，根据需要优化配置参数'
    ],
    4: [
        '第四步：编写Extend Script实现批量导出功能'
    ],
    5: [
        '第五步：把脚本整合进插件代码，实现在Pr界面调用批量导出功能'
    ],
}
